<script lang="ts">
	import type { ListItemData } from '$lib/types';
	import Section from '$lib/base-components/Section.svelte';
	import Container from '$lib/base-components/Container.svelte';
	import List from '$lib/base-components/List.svelte';

	export let data: ListItemData[];
</script>

<Section>
	<Container classes="2xl:max-w-3xl">
		<div class="primary-requirements">
			<p class="mb-5">
				Кваліфікований анестезіолог має вміти працювати з усіма видами анестезії - загальною (так
				званим наркозом), регіонарною та місцевою.
			</p>
			<p class="mb-5">
				Вільні вакансії лікаря-анестезіолога в Польщі є у відділеннях інтенсивної терапії в
				державних і приватних закладах стаціонарного типу, а також в амбулаторіях, обладнаних
				власними малими операційними.
			</p>
			<h6 class="mb-5 text-3xl font-bold">
				Кого візьмуть
				<span class=" text-biruza"> на роботу анестезіологом у польську клініку? </span>
			</h6>
			<p class="mb-5">
				На співбесіді з претендентом на посаду анестезіолога-реаніматолога роботодавець звертає
				увагу на наявність:
			</p>
            
			<List items={data} />

			<p class="mb-5">
				За інших рівних умов перевагу віддають претендентам, у резюме яких зазначено наявність
				важливих професійних та особистих якостей - стресостійкості, самовладання, зібраності,
				холоднокровності, хорошої пам'яті, а також неконфліктності, сумлінності та здатності
				ефективно працювати в команді.
			</p>
			<h6 class="mb-5 text-3xl font-bold">
				Умови, що
				<span class="text-biruza"> надаються </span>
			</h6>
			<p class="mb-5">
				Влаштовуючись на роботу анестезіологом до Польщі, іноземний фахівець може гарантовано
				розраховувати на:
			</p>
			<ul class="mb-5 list-disc pl-5">
				<li>зарплату від 7500 злотих брутто на місяць з подальшим збільшенням;</li>
				<li>
					нормований робочий день і доплати за будь-які перепрацювання, зокрема, за добові
					чергування;
				</li>
				<li>європейські соціальні гарантії;</li>
				<li>
					забезпечення уніформою, інструментами, медичними препаратами, витратними матеріалами,
					професійною літературою;
				</li>
				<li>грамотно облаштоване комфортне робоче місце;</li>
				<li>відстрочку нострифікації диплома.</li>
			</ul>
			<p class="mb-5">
				Додайте до цього оптимальні умови для здобуття нових знань, професійного та кар'єрного
				зростання, а також можливість працювати, орієнтуючись на високі стандарти європейської
				медицини. А потім, оцінивши всі вигоди та переваги, звертайтеся - підберемо для вас найкращу
				вакансію.
			</p>
		</div>
	</Container>
</Section>
