import type { PageServerLoad } from './$types';
import type {
	BreadcrumbType,
	SectionTitleTwoParagraphType,
	SectionTitleParListTwoParType,
	SectionTitleParListParType,
	SectionTitleParListParTypeTwo,
	SectionImageType
} from '$lib/types';

export const load: PageServerLoad = async () => {
	const BreadcrumbData: BreadcrumbType = {
		bredCrumbsHead: 'Головна',
		bredCrumbsCategories: 'Робота алергологом у Польщі'
	};

	const SectionTitleTwoParagraphData: SectionTitleTwoParagraphType = {
		title: 'Робота',
		subtitle: 'алергологом у Польщі',
		paragraph__one:
			'Як відомо, алергічні реакції безпосередньо пов`язані з роботою імунної системи. І чим нижчий імунітет популяції, тим частіше у дітей і дорослих проявляються різного роду алергічні реакції. У зв`язку з цим, а також з урахуванням масової робочої міграції фахівців до країн Західної Європи, робота алергологом у Польщі для іноземців сьогодні більш доступна, ніж будь-коли.',
		paragraph__two:
			'Ми займаємося працевлаштуванням іноземних лікарів, переважно, українців і білорусів, у польські медичні заклади впродовж кількох років. У нашому багажі - великий пул успішних кейсів і постійно оновлювана база актуальних вакансій. Знайдемо для вас роботу алергологом у Польщі з хорошою заробітною платою і комфортними умовами. А крім цього - надамо комплексну підтримку у вивченні мови, релокації, пошуку житла, оформленні документів.'
	};

	const SectionTitleParListTwoParData: SectionTitleParListTwoParType = {
		title: 'Посадові',
		subtitle: 'обов`язки анестезіолога',
		paragraph__one:
			'Повна назва цієї спеціалізації звучить як "анестезіолог-реаніматолог". Лікар цього профілю працює з усіма видами анестезії, а також займається веденням інтенсивної терапії. Таким чином, іноземні громадяни, які отримали роботу анестезіологами в Польщі:',
		list: [
			{ text: 'ретельно вивчають історію хвороби пацієнта;' },
			{
				text: 'проводять з ним особисту бесіду, інформують про те, яку анестезію буде застосовано, в якому стані перебуватиме пацієнт і які складнощі на нього можуть очікувати під час виходу з наркозу;'
			},
			{ text: 'проводять алергопроби;' },
			{
				text: 'визначаються з видом використовуваної анестезії, оцінюють ризики, підбирають препарати, прораховують дозування;'
			},
			{
				text: 'призначають так звану премедикацію - медикаментозну підготовку до введення анестезії;'
			},
			{ text: 'перебувають поруч із пацієнтом в операційній, контролюють його стан;' },
			{ text: 'за необхідності - проводять реанімаційні заходи;' },
			{ text: 'спостерігають хворого в ранньому післяопераційному періоді;' },
			{ text: 'оформляють медичну документацію.' }
		],
		paragraph__two:
			'Кваліфікований анестезіолог має вміти працювати з усіма видами анестезії - загальною (так званим наркозом), регіонарною та місцевою.',
		paragraph__three:
			'Вільні вакансії лікаря-анестезіолога в Польщі є у відділеннях інтенсивної терапії в державних і приватних закладах стаціонарного типу, а також в амбулаторіях, обладнаних власними малими операційними.'
	};

	const SectionTitleParListParData: SectionTitleParListParType = {
		title: 'Кого візьмуть ',
		subtitle: 'на роботу анестезіологом у польську клініку?',
		paragraph__one:
			'На співбесіді з претендентом на посаду анестезіолога-реаніматолога роботодавець звертає увагу на наявність:',
		list: [
			{ text: 'диплома про закінчення вищого медичного навчального закладу у себе в країні;' },
			{ text: 'сертифіката післядипломної підготовки з анестезіології;' },
			{ text: 'досвіду роботи не менше 3 років протягом останніх 5 років;' },
			{ text: 'дозволу на здійснення лікарської діяльності від МОЗ;' },
			{ text: 'ліцензії від місцевих органів виконавчої влади;' },
			{ text: 'володіння польською мовою з орієнтацією на медичну специфіку.' }
		],
		paragraph__two:
			'За інших рівних умов перевагу віддають претендентам, у резюме яких зазначено наявність важливих професійних та особистих якостей - стресостійкості, самовладання, зібраності, холоднокровності, хорошої пам`яті, а також неконфліктності, сумлінності та здатності ефективно працювати в команді.'
	};

	const SectionTitleParListParTypeTwoData: SectionTitleParListParTypeTwo = {
		title: 'Умови, що',
		subtitle: 'надаються',
		paragraph__one:
			'Влаштовуючись на роботу анестезіологом до Польщі, іноземний фахівець може гарантовано розраховувати на:',
		list: [
			{ text: 'зарплату від 7500 злотих брутто на місяць з подальшим збільшенням;' },
			{
				text: 'нормований робочий день і доплати за будь-які перепрацювання, зокрема, за добові чергування;'
			},
			{ text: 'європейські соціальні гарантії;' },
			{
				text: 'забезпечення уніформою, інструментами, медичними препаратами, витратними матеріалами, професійною літературою;'
			},
			{ text: 'грамотно облаштоване комфортне робоче місце;' },
			{ text: 'відстрочку нострифікації диплома.' }
		],
		paragraph__two:
			'Додайте до цього оптимальні умови для здобуття нових знань, професійного та кар`єрного зростання, а також можливість працювати, орієнтуючись на високі стандарти європейської медицини. А потім, оцінивши всі вигоди та переваги, звертайтеся - підберемо для вас найкращу вакансію.'
	};

	const SectionImageData: SectionImageType = {
		image: {
			src: '/img/all-article-web-page-content-img/article-alergologist.jpg',
			alt: 'article-anestesiologist'
		},
		source: {
			srcset: '/img/all-article-web-page-content-img/article-alergologist.webp',
			type: 'image/webp'
		},
		source1: {
			srcset: '/img/all-article-web-page-content-img/article-alergologist.avif',
			type: 'image/avif'
		}
	};

	return {
		BreadcrumbData,
		SectionTitleTwoParagraphData,
		SectionTitleParListTwoParData,
		SectionTitleParListParData,
		SectionTitleParListParTypeTwoData,
		SectionImageData
	};
};
