import type { PageServerLoad } from './$types';

export const load: PageServerLoad = async () => {
	const BreadcrumbData = {
		bredCrumbsHead: 'Головна',
		bredCrumbsCategories: 'Робота анестезіологом у Польщі'
	};

	const SectionWorkData = {
		heading: 'Робота',
		subtitle: 'анестезіологом у Польщі',
		paragraph1:
			'У зв`язку зі складною ситуацією з медичними кадрами польські роботодавці готові приймати на роботу анестезіологом у Польщі іноземних спеціалістів, зокрема з колишніх союзних республік, гарантуючи адекватну заробітну плату та інші преференції.',
		paragraph2:
			'Наша компанія пропонує працевлаштування та подальшу підтримку лікарям-вихідцям з України та Білорусі. З нашою допомогою ви отримаєте можливість обирати з великої кількості вакансій з різними умовами в різних регіонах країни.'
	};

	const SectionDutiesData = {
		heading: 'Посадові',
		subtitle: 'обов`язки анестезіолога',
		paragraph:
			'Повна назва цієї спеціалізації звучить як "анестезіолог-реаніматолог". Лікар цього профілю працює з усіма видами анестезії, а також займається веденням інтенсивної терапії. Таким чином, іноземні громадяни, які отримали роботу анестезіологами в Польщі:'
	};

	const SectionDutiesListData = [
		{ text: 'ретельно вивчають історію хвороби пацієнта;' },
		{
			text: 'проводять з ним особисту бесіду, інформують про те, яку анестезію буде застосовано, в якому стані перебуватиме пацієнт і які складнощі на нього можуть очікувати під час виходу з наркозу;'
		},
		{ text: 'проводять алергопроби;' },
		{
			text: 'визначаються з видом використовуваної анестезії, оцінюють ризики, підбирають препарати, прораховують дозування;'
		},
		{
			text: 'призначають так звану премедикацію - медикаментозну підготовку до введення анестезії;'
		},
		{ text: 'перебувають поруч із пацієнтом в операційній, контролюють його стан;' },
		{ text: 'за необхідності - проводять реанімаційні заходи;' },
		{ text: 'спостерігають хворого в ранньому післяопераційному періоді;' },
		{ text: 'оформляють медичну документацію.' }
	];

	const ListData = [
		{
			text: 'диплома про закінчення вищого медичного навчального закладу у себе в країні;'
		},
		{
			text: 'сертифіката післядипломної підготовки з анестезіології;'
		},
		{
			text: 'досвіду роботи не менше 3 років протягом останніх 5 років;'
		},
		{
			text: 'дозволу на здійснення лікарської діяльності від МОЗ;'
		},
		{
			text: 'ліцензії від місцевих органів виконавчої влади;'
		},
		{
			text: 'володіння польською мовою з орієнтацією на медичну специфіку.'
		}
	];

	const ListData2 = [
		{
			text: 'зарплату від 7500 злотих брутто на місяць з подальшим збільшенням;;'
		},
		{
			text: 'нормований робочий день і доплати за будь-які перепрацювання, зокрема, за добові чергування;'
		},
		{
			text: 'європейські соціальні гарантії;'
		},
		{
			text: 'забезпечення уніформою, інструментами, медичними препаратами, витратними матеріалами, професійною літературою;'
		},
		{
			text: 'грамотно облаштоване комфортне робоче місце;'
		},
		{
			text: 'відстрочку нострифікації диплома.'
		}
	];

	return {
		BreadcrumbData,
		SectionWorkData,
		SectionDutiesData,
		ListData,
		ListData2,
		SectionDutiesListData
	};
};
