import type { PageServerLoad } from './$types';

export const load: PageServerLoad = async () => {
	const BreadcrumbData = {
		bredCrumbsHead: 'Головна',
		bredCrumbsCategories: 'Робота анестезіологом у Польщі'
	};
	const SectionWorkData = {
		heading: 'Робота',
		subtitle: 'анестезіологом у Польщі',
		paragraph1:
			'У зв`язку зі складною ситуацією з медичними кадрами польські роботодавці готові приймати на роботу анестезіологом у Польщі іноземних спеціалістів, зокрема з колишніх союзних республік, гарантуючи адекватну заробітну плату та інші преференції.',
		paragraph2:
			'Наша компанія пропонує працевлаштування та подальшу підтримку лікарям-вихідцям з України та Білорусі. З нашою допомогою ви отримаєте можливість обирати з великої кількості вакансій з різними умовами в різних регіонах країни.'
	};
	const SectionDutiesData = {
		heading: 'Посадові',
		subtitle: 'обов`язки анестезіолога',
		paragraph:
			'Повна назва цієї спеціалізації звучить як "анестезіолог-реаніматолог". Лікар цього профілю працює з усіма видами анестезії, а також займається веденням інтенсивної терапії. Таким чином, іноземні громадяни, які отримали роботу анестезіологами в Польщі:',
		list1: 'ретельно вивчають історію хвороби пацієнта;',
		list2:
			'проводять з ним особисту бесіду, інформують про те, яку анестезію буде застосовано, в якому стані перебуватиме пацієнт і які складнощі на нього можуть очікувати під час виходу з наркозу;',
		list3: 'проводять алергопроби;',
		list4:
			'визначаються з видом використовуваної анестезії, оцінюють ризики, підбирають препарати, прораховують дозування;',
		list5: 'призначають так звану премедикацію - медикаментозну підготовку до введення анестезії;',
		list6: 'перебувають поруч із пацієнтом в операційній, контролюють його стан;',
		list7: 'за необхідності - проводять реанімаційні заходи;',
		list8: 'спостерігають хворого в ранньому післяопераційному періоді;',
		list9: 'оформляють медичну документацію.'
	};

	return {
		BreadcrumbData,
		SectionWorkData,
		SectionDutiesData
	};
};
